#include<iostream>
#include<string>
#include"md5.h"

using namespace std;


int main() 
{
	string Message = "";

	cout << "***************************************************************************" << endl;
	cout << "*                             MD5哈希算法实现程序                         *" << endl;
	cout << "***************************************************************************" << endl;
	cout << "开始测试" << endl;
	cout << "---------------------------------------------------------------------------" << endl;
	cout << "请输入消息：" << endl;
	cin >> Message;
	cout << "---------------------------------------------------------------------------" << endl;
	cout << "128比特摘要 H(Message)为:" << endl;
	cout << md5(Message) << endl;
	cout << "---------------------------------------------------------------------------" << endl;
	system("pause");
	return 0;
}